In [9]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt #conventional syntax 
import random
from sklearn.model_selection import train_test_split

In [2]:
data = pd.DataFrame({'age':[10,20,40,50,44,56,12,34,56, 75, 87, 22, 13, 34, 42, 43, 52]})

In [3]:
data

    age
0    10
1    20
2    40
3    50
4    44
5    56
6    12
7    34
8    56
9    75
10   87
11   22
12   13
13   34
14   42
15   43
16   52

In [5]:
list(range(0, 101, 10))

[0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

In [6]:
data['agebinned'] = pd.cut(data.age, bins=range(0, 101, 10), retbins=False,include_lowest=True)
data

    age       agebinned
0    10  (-0.001, 10.0]
1    20    (10.0, 20.0]
2    40    (30.0, 40.0]
3    50    (40.0, 50.0]
4    44    (40.0, 50.0]
5    56    (50.0, 60.0]
6    12    (10.0, 20.0]
7    34    (30.0, 40.0]
8    56    (50.0, 60.0]
9    75    (70.0, 80.0]
10   87    (80.0, 90.0]
11   22    (20.0, 30.0]
12   13    (10.0, 20.0]
13   34    (30.0, 40.0]
14   42    (40.0, 50.0]
15   43    (40.0, 50.0]
16   52    (50.0, 60.0]

In [7]:
pd.get_dummies(data.agebinned)

,"(-0.001, 10.0]","(10.0, 20.0]","(20.0, 30.0]","(30.0, 40.0]","(40.0, 50.0]","(50.0, 60.0]","(60.0, 70.0]","(70.0, 80.0]","(80.0, 90.0]","(90.0, 100.0]"
0,1,0,0,0,0,0,0,0,0,0
1,0,1,0,0,0,0,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0
3,0,0,0,0,1,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0
5,0,0,0,0,0,1,0,0,0,0
6,0,1,0,0,0,0,0,0,0,0
7,0,0,0,1,0,0,0,0,0,0
8,0,0,0,0,0,1,0,0,0,0
9,0,0,0,0,0,0,0,1,0,0
10,0,0,0,0,0,0,0,0,1,0
11,0,0,1,0,0,0,0,0,0,0
12,0,1,0,0,0,0,0,0,0,0
13,0,0,0,1,0,0,0,0,0,0
14,0,0,0,0,1,0,0,0,0,0
15,0,0,0,0,1,0,0,0,0,0
16,0,0,0,0,0,1,0,0,0,0

## split data

In [8]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
X = titanic_df.drop(columns="Survived")
X

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
y = titanic_df.Survived
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [14]:
titanic_df.shape

(891, 12)

In [13]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=42)

In [15]:
X_train.shape

(668, 11)

In [16]:
X_test.shape

(223, 11)

In [18]:
y_train.shape, y_test.shape

((668,), (223,))

In [19]:
df = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [20]:
df[df.date < march 2021]

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
X = df.drop(columns="species")
y = df.species

In [24]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=42)

In [25]:
X_train.shape, X_test.shape

((112, 4), (38, 4))

In [26]:
y_train.shape, y_test.shape

((112,), (38,))

In [27]:
X_train.head()

     sepal_length  sepal_width  petal_length  petal_width
4             5.0          3.6           1.4          0.2
32            5.2          4.1           1.5          0.1
142           5.8          2.7           5.1          1.9
85            6.0          3.4           4.5          1.6
86            6.7          3.1           4.7          1.5

In [28]:
X_test.head()

     sepal_length  sepal_width  petal_length  petal_width
73            6.1          2.8           4.7          1.2
18            5.7          3.8           1.7          0.3
118           7.7          2.6           6.9          2.3
78            6.0          2.9           4.5          1.5
76            6.8          2.8           4.8          1.4

In [30]:
lst = [1,2,3,4,5, 5]
lst

[1, 2, 3, 4, 5, 5]

In [32]:
set1 = set([1,2,3,4])
set2 = set([4,5,6,7])

In [35]:
set1 & set2

{4}

In [37]:
set(X_train.index) & set(X_test.index)

set()

In [38]:
set(y_train.index) & set(y_test.index)

set()